## **Questions based on Titanic Dataset:**

To read the dataset as csv, use the below code:

```python
import pandas as pd

url = "https://docs.google.com/spreadsheets/d/e/2PACX-1vQjh5HzZ1N0SU7ME9ZQRzeVTaXaGsV97rU8R7eAcg53k27GTstJp9cRUOfr55go1GRRvTz1NwvyOnuh/pub?gid=1562145139&single=true&output=csv"
titanic_df = pd.read_csv(url)
```

In [2]:
import pandas as pd
import numpy as np 

url = "https://docs.google.com/spreadsheets/d/e/2PACX-1vQjh5HzZ1N0SU7ME9ZQRzeVTaXaGsV97rU8R7eAcg53k27GTstJp9cRUOfr55go1GRRvTz1NwvyOnuh/pub?gid=1562145139&single=true&output=csv"
titanic_df = pd.read_csv(url)

In [4]:
titanic_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

### `Q-1:` Using `groupby` make groups using the `"Pclass"` column and find out the average age and total number of missing values in the `"Age"` column for every group.

In [6]:
# code here
nullAge = titanic_df[titanic_df["Age"].isnull()].groupby("Pclass")["Pclass"].count().reset_index(name = "Null Age")
titanic_df.groupby("Pclass")["Age"].mean().reset_index(name = "Avg_age").merge(nullAge, on="Pclass")

   Pclass    Avg_age  Null Age
0       1  38.233441        30
1       2  29.877630        11
2       3  25.140620       136

### `Q-2:` Using `groupby` make groups using the `"Pclass"` column and fill every group's `"Embarked"` column's missing values with there mode value of that group. After that, print every group's `"Embarked"` column's value counts in ascending order.

In [8]:
# code here
mode_index = titanic_df.groupby("Embarked")["Embarked"].count().idxmax()
titanic_df['Embarked']=titanic_df['Embarked'].fillna(mode_index)
titanic_df['Embarked'].isnull().sum()

0

### `Q-3:` Make groups based on `"Embarked"` column. And for each of this embarked group, make another group based on `"Pclass"` and find out the average fare (round off up to 2 decimal places) for each "Pclass" for each group of "Embarked".

**Sample Output:**

```bash
{'C': {1: 105, 2: 25, 3: 11},
 'Q': {1: 90, 2: 12, 3: 11},
 'S': {1: 70, 2: 20, 3: 15}}
```

In [34]:
# code here
temp = np.around(titanic_df.groupby(["Pclass","Embarked"])["Fare"].mean(),decimals=2).unstack()
temp.to_dict()

{'C': {1: 104.72, 2: 25.36, 3: 11.21},
 'Q': {1: 90.0, 2: 12.35, 3: 11.18},
 'S': {1: 70.51, 2: 20.33, 3: 14.64}}

## **Questions Based on Fifa Worldcup - 2022 Dataset:**

You can read the dataset by using the below sample code

```python
import pandas as pd

fifa_df = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT3D_x_4DS6d51LKJ7ze1sxT5WpV5uiSVOFYHLwBiGru6vFyVv5h5-83AwFjxWYiWfCDjDAaarHAV-k/pub?gid=0&single=true&output=csv")
```

In [35]:
import pandas as pd

fifa = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT3D_x_4DS6d51LKJ7ze1sxT5WpV5uiSVOFYHLwBiGru6vFyVv5h5-83AwFjxWYiWfCDjDAaarHAV-k/pub?gid=0&single=true&output=csv")
fifa.head(2)

,Sl. No,Match No.,Team,Against,Group,Goal,Possession (%),Inside Penalty Area,Outside Penalty Area,Assists,...,Fouls Against,Offsides,Passes,Passes Completed,Crosses,Crosses Completed,Corners,Free Kicks,Penalties Scored,Pts
0,1,1,Qatar,Ecuador,A,0,40,0,0,0,...,15,3,453,387,10,5,1,19,0,0
1,2,1,Ecuador,Qatar,A,2,46,2,0,1,...,15,4,484,419,26,10,3,17,1,3

In [36]:
fifa.columns

Index(['Sl. No', 'Match No.', 'Team', 'Against', 'Group', 'Goal',
       'Possession (%)', 'Inside Penalty Area', 'Outside Penalty Area',
       'Assists', 'Total Attempts', 'On Target', 'Off Target',
       'Target in Penalty', 'Target from Outside', 'Left Channel',
       'Left Inside Channel', 'Central Channel', 'Right Inside Channel',
       'Right Channel', 'Receptions MD', 'Receptions D',
       'Attempted Line Breaks', 'Completed Line Breaks',
       'Attempted Defensive Line Breaks', 'Completed Defensive Line Breaks',
       'Yellow Cards', 'Red Cards', 'Fouls Against', 'Offsides', 'Passes',
       'Passes Completed', 'Crosses', 'Crosses Completed', 'Corners',
       'Free Kicks', 'Penalties Scored', 'Pts'],
      dtype='object')

### `Q-4:` Perform `groupby` based on the `"Team"` column and then perform Z Normalization on top of the below columns of each group:
1. Passes
2. Passes Completed
3. Attempted Line Breaks
4. Completed Line Breaks

You have to make a python function named `z_normalization` which takes two arguments:

1. *group:* Every group that you have created
2. *cols_to_perform:* This parameter takes a list of columns on which you have to perform the Z-Normalization.

For this problem, you have to use th `apply()` method.

$\Large Z \ - \ Normalization = \frac{X_i - \mu}{std} $

After that find out the below values for each group:
- minimum "Passess"
- maximum "Passess"
- minimum "Yellow Cards"
- maximum "Yellow cards"
- average "Yellow Cards"
- maximum "Attempted Line Breaks"
- minimum "Attempted Line Breaks"
- standardard deviation of "Attempted Line Breaks"
- average Possession

In [40]:
# code here
fifa2 = fifa.groupby("Team")[["Passes","Passes Completed","Attempted Line Breaks","Completed Line Breaks"]].transform(lambda x: (x-x.mean())/x.std())

In [42]:
fifa2.head(5)

     Passes  Passes Completed  Attempted Line Breaks  Completed Line Breaks
0  0.462725          0.410365              -0.815368              -1.153113
1  1.085876          1.123095              -0.039193               0.817624
2  1.705844          1.718012              -1.172641              -1.334904
3 -0.820695         -0.761575              -1.152297              -1.147648
4 -0.020934          0.032483              -1.077420              -0.355371

In [52]:
def summary(group):
    return pd.Series({
        "minimumPasses": group["Passes"].min(),
        "maximumPasses": group["Passes"].max(),
        "minimumYellowCards": group["Yellow Cards"].min(),
        "maximumYellowCards": group["Yellow Cards"].max(),
        "averageYellowCards": group["Yellow Cards"].mean(),
        "maximumAttemptedLineBreaks": group["Attempted Line Breaks"].max(),
        "minimumAttemptedLineBreaks": group["Attempted Line Breaks"].min(),
        "stdAttemptedLineBreaks": group["Attempted Line Breaks"].std(),
        "averagePossession%": group["Possession (%)"].mean()
    })

fifa_summary = fifa.groupby("Team").apply(summary)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_6248\3142911146.py:14: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  fifa_summary = fifa.groupby("Team").apply(summary)

In [54]:
fifa_summary.head()

,minimumPasses,maximumPasses,minimumYellowCards,maximumYellowCards,averageYellowCards,maximumAttemptedLineBreaks,minimumAttemptedLineBreaks,stdAttemptedLineBreaks,averagePossession
Team,,,,,,,,,
Argentina,408.0,862.0,0.0,8.0,2.285714,249.0,141.0,38.774685,49.285714
Australia,286.0,466.0,0.0,3.0,1.750000,171.0,133.0,17.682383,31.250000
Belgium,512.0,685.0,1.0,3.0,1.666667,195.0,167.0,14.422205,49.000000
Brazil,548.0,695.0,0.0,3.0,1.200000,193.0,164.0,10.691118,50.400000
Cameroon,295.0,500.0,1.0,5.0,2.666667,182.0,144.0,19.857828,38.333333

## **Questions on IPL wala dataset**

ball by ball dataset - https://drive.google.com/file/d/1-kvv_9KCSAFWcrhS9WgTxSrURkRh6GNt/view?usp=share_link

In [2]:
import pandas as pd 
import numpy as np
ipl = pd.read_csv("ipl_deliveries.csv")
ipl.head(3)

,ID,Team,innings,overs,ballnumber,batter,bowler,non-striker,extra_type,batsman_run,extras_run,total_run,non_boundary,isWicketDelivery,player_out,kind,fielders_involved,BattingTeam,BowlingTeam
0,1312200,Rajasthan RoyalsGujarat Titans,1,0,1,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
1,1312200,Rajasthan RoyalsGujarat Titans,1,0,2,YBK Jaiswal,Mohammed Shami,JC Buttler,legbyes,0,1,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
2,1312200,Rajasthan RoyalsGujarat Titans,1,0,3,JC Buttler,Mohammed Shami,YBK Jaiswal,NaN,1,0,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans

###`Q-5:` Find batsman in below category-
* Highest score while chasing
* Best Strike rate while chasing and have faced 100+ balls


> Chasing mean team batting in second inning

In [6]:
# code here
ipl[ipl["innings"]==2].groupby("batter")["batsman_run"].sum().idxmax()

'V Kohli'

In [8]:
# Best Strike rate while chasing and have faced 100+ balls 

ballPlayed = ipl["batter"].value_counts()
strik = ipl[ipl["innings"]==2].groupby("batter")["batsman_run"].sum().reset_index(name="Total_run").merge(ballPlayed,on="batter")
strik["Strik Rate"] = (strik['Total_run']/strik["count"])*100
strik[strik["count"]>100].sort_values(by="Strik Rate",ascending=False).head(5)

           batter  Total_run  count  Strik Rate
458     SM Katich        230    191  120.418848
219     K Gowtham        136    115  118.260870
113      D Brevis        120    116  103.448276
326      N Pooran        632    630  100.317460
92   Bipul Sharma        119    124   95.967742

###`Q-6` Most Successful bowler against any batsman. Find that pair of bowler and batsman.
> Most Successful in terms of dissmissal. A bowler who have dissmissed any batsman most no of times. If any two pairs have same no of dissmisal, consider runs conceded by bowler to that batsman. Those who have concede lesser runs is more successful.

In [10]:
# code here
ipl.groupby(["bowler","batter"])[["isWicketDelivery","batsman_run"]].sum().sort_values(ascending=False,by=["isWicketDelivery","batsman_run"]).head(5)

                           isWicketDelivery  batsman_run
bowler         batter
SP Narine      RG Sharma                  8          137
R Ashwin       RV Uthappa                 7          123
PP Ojha        MS Dhoni                   7           98
A Mishra       RG Sharma                  7           87
Sandeep Sharma V Kohli                    7           78

###`Q-7`: Most successful batting pair in IPL. Batting pair who have scored most runs playing together.

In [12]:
ipl["pair"] = ipl.apply(lambda row: tuple(sorted([row["batter"], row["non-striker"]])), axis=1)

pair_player = ipl.groupby(["ID","pair"])["batsman_run"].sum().sort_values(ascending=False).head(5).reset_index(name="total_Pair_runs")

# ipl.head(5)
pair_player.head()

        ID                       pair  total_Pair_runs
0   980987  (AB de Villiers, V Kohli)              226
1   829795  (AB de Villiers, V Kohli)              209
2  1304112      (KL Rahul, Q de Kock)              208
3   548372        (CH Gayle, V Kohli)              200
4   501260   (AC Gilchrist, SE Marsh)              184

In [16]:
pair_player.groupby("pair")["total_Pair_runs"].mean().reset_index(name = "AVG").merge(ipl["pair"].value_counts(), on="pair")

                        pair    AVG  count
0  (AB de Villiers, V Kohli)  217.5   2059
1   (AC Gilchrist, SE Marsh)  184.0    465
2        (CH Gayle, V Kohli)  200.0   1973
3      (KL Rahul, Q de Kock)  208.0    425

###`Q-8:` Make a dataframe for all batting pairs played together.
```
Batsman1 Batsman2 Runs Avg StrikeRate
```

> Just to ease this question you can count wide-balls for strike rate.

In [5]:
# code here

# batter, non_striker, batsman_run, ball, extra_type, dismissal_kind

# ipl.groupby(["batter","non-striker"]).agg({
#     "batsman_run":"sum",
#     "ball":"size",
#     "extra_type":"count",
#     "dismissal_kind":"count"
# })
ipl.columns

Index(['ID', 'Team', 'innings', 'overs', 'ballnumber', 'batter', 'bowler',
       'non-striker', 'extra_type', 'batsman_run', 'extras_run', 'total_run',
       'non_boundary', 'isWicketDelivery', 'player_out', 'kind',
       'fielders_involved', 'BattingTeam', 'BowlingTeam'],
      dtype='object')

In [7]:
ipl.head(2)

,ID,Team,innings,overs,ballnumber,batter,bowler,non-striker,extra_type,batsman_run,extras_run,total_run,non_boundary,isWicketDelivery,player_out,kind,fielders_involved,BattingTeam,BowlingTeam
0,1312200,Rajasthan RoyalsGujarat Titans,1,0,1,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
1,1312200,Rajasthan RoyalsGujarat Titans,1,0,2,YBK Jaiswal,Mohammed Shami,JC Buttler,legbyes,0,1,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans